app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @songs = Song.find(params[:artist_id]).songs
    else
    @songs = Song.all
---
SELECT "songs".* FROM "songs"